---
kind: enumMember
id: F:Autodesk.Revit.DB.TransactionStatus.Uninitialized
enum: Autodesk.Revit.DB.TransactionStatus
source: html/29b9a7a8-6754-8310-e063-622b569bb6d5.htm
---
# Autodesk.Revit.DB.TransactionStatus.Uninitialized

initial value, the transaction has not been started yet in this status